08_pokemon/pokedex_app/app/controllers/pokemons_controller.rb

INSERT INTO "pokemons" ("species", "nickname", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["species", "Ivysaur"], ["nickname", "Whipper"], ["level", 15], ["created_at", "2018-05-03 00:26:53.208463"], ["updated_at", "2018-05-03 00:26:53.208463"]]
---
  def create
    pokemon = Pokemon.new
    pokemon.species = params[:species]
    pokemon.nickname = params[:nickname]
    pokemon.level = params[:level]
    pokemon.save